// const areYouSure = confirm("Are you sure you want to delete this item?");
// console.log(areYouSure);
// const login = prompt("Please enter your login:", "admin");
// console.log(login);
// const newAlert = alert("Hello");
// console.log(areYouSure);

// Запропонуйте користувачу ввести число за допомогою prompt().
// Збережіть введене значення у змінну number.
// Перевірте, чи дорівнює змінна number числу 10:
//    Якщо так – виведіть повідомлення 'Вірно' у alert().
//    Якщо ні – виведіть 'Невірно'.

// Підказка: prompt завжди повертає рядок (String), тому перед перевіркою
// перетворіть значення на число за допомогою Number().

// const number = Number(prompt("Please enter a number:"));

// if (number === 10) {
//   alert("Вірно");
// } else {
//   alert("Невірно");
// }

// Напишіть код, який запитуватиме у користувача
// логін за допомогою prompt і виводить результат в консоль браузера

// Після цього додайте перевірку введеного користувачем значення:
// Якщо відвідувач вводить "Адмін",
// то prompt запитує пароль (не забудьте зберігти його у змінну для подальшої перевірки).
// Якщо нічого не ввели або натиснули Cancel,
// Вивести в alert строку "Скасовано"
// В іншому випадку вивести в alert рядок "Я вас не знаю"

// Пароль перевіряти так:
// Якщо введено пароль "Я головний",
// то вивести в alert рядок "Добрий день!",
// в іншому випадку вивести в alert рядок "Невірний пароль!"

// const login = prompt("Login");

// if (login === "Адмін") {
//   const password = prompt("Password");
//   password === "Я головний" ? alert("Добрий день!") : alert("Невірний пароль!");
// } else if (login === null) {
//   alert("Скасовано");
// } else {
//   alert("Я вас не знаю");
// }

//? Використайте цикл while, щоб вивести в console всі числа від 0 до 20 включно.
// let count = 0;
// while (count <= 20) {
//   console.log(count);
//   count += 1;
// }

//? Напишіть функцію getNumbers(min, max), що приймає 2 параметри -
// мінімальне і максимальне число відповідно.
// Напишіть цикл всередині функції, який виводить у консоль
// всі числа від max до min за спаданням.
// Окрім цього, підрахуйте суму всіх парних чисел в цьому циклі
// і поверніть її з функції.

// function getNumbers(min, max) {
//   let sumNumbers = 0;
//   for (let i = max; i >= min; i--) {
//     console.log(i);
//     if (i % 2 === 0) {
//       sumNumbers += i;
//     }
//   }
//   return sumNumbers;
// }

// const result = getNumbers(7, 12);
// console.log(result);

//? Напишіть функцію min(a, b), яка приймає 2 числа і повертає меньше з них.
// Потрібно додати перевірку, що функція отримує саме числа, в іншому випадку
// повертати з функції рядок - 'Not a number!'.

// function min(a, b) {
//   if (typeof a !== "number" || typeof b !== "number") {
//     return "Not a number!";
//   }

//   return Math.min(a, b);
// }
// console.log(min(15, 7));

//? Напишіть функцію isAdult(age), яка  приймає число - вік користувача і повертає true,
// якщо параметр age більше чи дорівнює 18.
// В іншому випадку вона запитує підтвердження через confirm
// і повертає його результат (true/false).

// function isAdult(age) {
//   if (age >= 18) {
//     return true;
//   }
//   return confirm("Скільки вам років?");
// }
// console.log(isAdult());

//? Напишіть функцію fizzBuzz(num), яка приймає число і перевіряє кожне число від 1 до num:
// Якщо число ділитися  без остачі на 3 - виводить в консоль 'fizz',
// якщо ділиться  без остачі на 5 - виводить в консоль 'buzz',
// якщо ділиться  без остачі і на 3, і на 5 - виводить в консоль 'fizzbuzz'.

function fizzBuzz(num) {
  for (let i = 1; i <= num; i++) {
    if (i % 3 === 0 && i % 5 === 0) {
      console.log("fizzbuzz");
    } else if (i % 3 === 0) {
      console.log("fizz");
    } else if (i % 5 === 0) {
      console.log("buzz");
    }
  }
}

fizzBuzz(15);

// 1. Напишіть цикл, який пропонує ввести
// число більше 100 через prompt.
// Якщо користувач ввів інше число - попросити
// ввести ще раз.
// Цикл повинен питати число, доки користувач не
// введе число більше 100, чи не натисне кнопку
// Cancel в prompt

// 2. Напишіть функцію, яка приймає адресу сайта url та перевіряє чи закінчується значення
// параметра символом /. Якщо ні, додайте до кінця
// значення url цей символ і поверніть оновлене значення з функції, але тільки в тому випадку,
// якщо в url є підрядок "my-site".
// В іншому випадку поверніть з функції адресу в незмінному вигляді

// const url = "https://my-site.com/about";

let num;
do {
  num = prompt("Введіть число:");
  if (num === null) {
    break;
  }
  num = Number(num);
} while (num <= 100);

// Доп.2

function haveSimb(val) {
  console.log(
    `🚀 ~ haveSimb ~ val.includes("my-site") && val.endsWith("/"):`,
    val.includes("my-site") && !val.endsWith("/")
  );
  if (val.includes("my-site") && !val.endsWith("/")) {
    return val + "/";
  } else {
    return val;
  }
}
